size(1200, 800);
background(255);
/*
PImage img;
 img = loadImage("imagen3.jpg");
 background(img);
 */

stroke(255, 239, 88);
strokeWeight(20);
line(0, 230, 1200, 230);//primera
line(0, 330, 1200, 330);//segunda
line(0, 470, 1200, 470);//tercera
line(0, 530, 1200, 530);//cuarta

line(0, 600, 90, 600);//primera corta
line(90, 650, 690, 650);//segunda corta
line(0, 710, 90, 710);//tercera corta
line(970, 730, 1105, 730);//cuarta corta

line(50, 0, 50, 230);//primera
line(90, 0, 90, 800);//segunda
line(150, 0, 150, 800);//tercera
line(280, 0, 280, 800);//cuarta
line(650, 0, 650, 800);//quinta
line(690, 0, 690, 230);//sexta 1
line(690, 330, 690, 800);//sexta 2
line(760, 330, 760, 530);//septima (centro)
line(970, 0, 970, 800);//septima
line(1015, 0, 1015, 230);//octava
line(1060, 0, 1060, 330);//novena 1
line(1060, 530, 1060, 730);//novena 2
line(1105, 0, 1105, 800);//decima

rectMode(CORNERS);
fill(255, 239, 88);

rect(150, 140, 280, 190);//primero
rect(150, 710, 280, 800);//segundo
rect(195, 230, 235, 330);//tercero
rect(350, 330, 400, 450);//cuarto
rect(490, 230, 550, 450);//quinto
rect(970, 380, 1105, 410);//sexto
rect(970, 640, 1105, 660);//séptimo abajo
//azul
fill(69, 92, 206);
strokeWeight(0);

rect(100, 40, 160, 100);//primero
rect(100, 580, 160, 640);//segundo
rect(340, 360, 410, 460);//tercero
rect(760, 0, 850, 220);//cuarto
rect(980, 570, 1050, 630);//quinto
//rojo
fill(206, 58, 58);

rect(160, 380, 270, 460);//primero
rect(760, 85, 850, 180);//segundo
rect(795, 340, 890, 520);//tercero
rect(1005, 60, 1070, 120);//cuarto
rect(980, 670, 1050, 720);//quinto
//amarillo
fill(255, 239, 88);

rect(355, 390, 395, 425);
rect(780, 120, 835, 160);
//beige
fill(214, 214, 214);

rect(195, 150, 235, 180);//primero
rect(203, 263, 232, 292);//segundo
rect(200, 715, 240, 745);//tercero
rect(480, 360, 561, 420);//cuarto
rect(815, 375, 875, 425);//quinto
rect(795, 495, 890, 520);//sexto

stroke(214, 214, 214);
strokeWeight(0);
//rectangulos chiquitos
rectMode(CENTER);

rect(521, 330, 80, 20);
rect(850, 470, 60, 20);

//línea uno beige
rect(50, 210, 20, 20);
//línea uno azul
fill(69, 92, 206);
rect(50, 70, 20, 20);

//línea uno rojo
fill(206, 58, 58);
rect(50, 130, 20, 20);
rect(50, 230, 20, 20);

//línea dos beige
fill(214, 214, 214);
rect(90, 20, 20, 40);
rect(90, 110, 20, 20);
rect(90, 450, 20, 20);
rect(90, 585, 20, 15);
rect(90, 625, 20, 30);
rect(90, 730, 20, 20);

//línea dos azul
fill(69, 92, 206);
rect(90, 230, 20, 20);
rect(90, 330, 20, 20);
rect(90, 470, 20, 20);

//línea dos rojo
fill(206, 58, 58);
rect(90, 410, 20, 20);
rect(90, 530, 20, 20);
rect(90, 600, 20, 20);
rect(90, 650, 20, 20);
rect(90, 710, 20, 20);

//tercera línea beige
fill(214, 214, 214);
rect(150, 175, 20, 50);
rect(150, 230, 20, 20);
rect(150, 290, 20, 60);
rect(151, 720, 20, 20);

//tercera linea azul
fill(69, 92, 206);
rect(150, 210, 20, 20);
rect(150, 250, 20, 20);
rect(150, 420, 20, 20);
rect(150, 470, 20, 20);
rect(150, 530, 20, 20);
rect(151, 700, 20, 20);

//tercera línea rojo
fill(206, 58, 58);
rect(150, 140, 20, 20);
rect(150, 330, 20, 20);
rect(150, 650, 20, 21);
rect(151, 740, 20, 20);

//línea 4 beige
fill(214, 214, 214);
rect(280, 20, 20, 40);
rect(280, 175, 20, 20);
rect(280, 250, 20, 20);
rect(280, 350, 20, 20);
rect(280, 390, 20, 20);
rect(280, 450, 20, 20);
rect(280, 590, 20, 20);
rect(280, 730, 20, 20);
rect(280, 790, 20, 50);

//línea 4 azul
fill(69, 92, 206);
rect(280, 70, 20, 20);
rect(280, 230, 20, 20);
rect(280, 330, 20, 20);
rect(280, 470, 20, 20);
rect(280, 650, 20, 20);

//línea 4 rojo
fill(206, 58, 58);
rect(280, 140, 20, 20);
rect(280, 530, 20, 20);
rect(280, 710, 20, 20);

//línea 5 beige
fill(214, 214, 214);
rect(650.5, 110, 20, 20);
rect(650.5, 248, 20, 15);
rect(651, 330, 20, 20);
rect(651, 470, 20, 20);
rect(651, 530, 20, 20);
rect(651, 570, 20, 20);
rect(651, 650, 20, 20);

//línea 5 azul
fill(69, 92, 206);
rect(650.5, 180, 20, 20);
rect(650.5, 265, 20, 20);
rect(651, 710, 20, 20);

//línea 5 rojo
fill(206, 58, 58);
rect(650.5, 81, 20, 40);
rect(650.5, 230, 20, 20);
rect(650.5, 390, 20, 20);
rect(651, 510, 20, 20);
rect(651, 550, 20, 20);
rect(651, 780, 20, 50);

//línea 6 beige
fill(214, 214, 214);
rect(690.5, 20, 20, 40);
rect(690.5, 110, 20, 20);
rect(690.5, 180, 20, 20);
rect(690.5, 330, 20, 20);
rect(690.5, 470, 20, 20);
rect(690.5, 530, 20, 20);
rect(690.5, 605, 20, 20);
rect(690.5, 650, 20, 20);
rect(690.5, 730, 20, 20);

//línea 6 azul
fill(69, 92, 206);
rect(690.5, 230, 20, 20);
rect(690.5, 390, 20, 20);
rect(690.5, 550, 20, 20);

//línea 6 rojo
fill(206, 58, 58);
rect(690.5, 81, 20, 20);
rect(690.5, 450, 20, 20);
rect(690.5, 710, 20, 20);

//línea 7 (centro) beige
fill(214, 214, 214);
rect(760.5, 330, 20, 20);
rect(760.5, 400, 20, 20);
rect(761, 530, 20, 20);

//línea 7(centro) rojo
fill(206, 58, 58);
rect(760.5, 470, 20, 20);
rect(761, 510, 20, 20);

//línea 7 beige
fill(214, 214, 214);
rect(970.5, 160, 20, 20);
rect(970.5, 310, 20, 20);
rect(970.5, 510, 20, 20);
rect(970.5, 555, 20, 30);
rect(970.5, 640, 20, 30); //*****

//línea 7 azul
fill(69, 92, 206);
rect(970.5, 180, 20, 20);
rect(970.5, 230, 20, 20);
rect(970.5, 395, 20, 20);
rect(970.5, 530, 20, 20);
rect(970.5, 660, 20, 20);
rect(970.5, 730, 20, 20);

//línea 7 rojo
fill(206, 58, 58);
rect(970.5, 90, 20, 25);
rect(970.5, 330, 20, 20);
rect(970.5, 470, 20, 20);
rect(970.5, 620, 20, 20);

//línea 8 beige
fill(214, 214, 214);
rect(1015.5, 30, 20, 60);
rect(1015.5, 130, 20, 20);

//línea 8 azul
fill(69, 92, 206);
rect(1015.5, 180, 20, 20);

//línea 8 rojo
fill(206, 58, 58);
rect(1015.5, 230, 20, 20);

//línea 9 beige
fill(214, 214, 214);
rect(1060.5, 30, 20, 60);
rect(1060.5, 130, 20, 20);
rect(1060.5, 185, 20, 20);
rect(1060.5, 230, 20, 20);
rect(1060.5, 270, 20, 20);
rect(1060.5, 550, 20, 20);
rect(1060.5, 635, 20, 30);
rect(1060.5, 730, 20, 20);

//línea 9 azul
fill(69, 92, 206);
rect(1060.5, 660, 20, 20);

//línea 9 rojo
fill(206, 58, 58);
rect(1060.5, 330, 20, 20);
rect(1060.5, 530, 20, 20);

//línea 10 beige
fill(214, 214, 214);
rect(1105.5, 50, 20, 20);
rect(1105.5, 110, 20, 20);
rect(1105.5, 230, 20, 20);
rect(1105.5, 310, 20, 20);
rect(1105.5, 410, 20, 20);
rect(1105.5, 510, 20, 20);
rect(1105.5, 550, 20, 20);
rect(1105.5, 640, 20, 20);

//línea 10 azul
fill(69, 92, 206);
rect(1105.5, 90, 20, 20);
rect(1105.5, 390, 20, 20);
rect(1105.5, 660, 20, 20);

//línea 10 rojo
fill(206, 58, 58);
rect(1105.5, 180, 20, 20);
rect(1105.5, 330, 20, 20);
rect(1105.5, 470, 20, 20);
rect(1105.5, 620, 20, 20);
rect(1105.5, 730, 20, 20);

//horizontal
//linea 1 beige
fill(214, 214, 214);
rect(258, 230, 24, 20);
rect(340, 230, 30, 20);

//línea 1 azul
fill(69, 92, 206);
rect(400, 230, 25, 20);
rect(570, 230, 20, 20);
rect(1083, 230, 25, 20);

//línea 1 rojo
fill(206, 58, 58);
rect(173, 230, 26, 20);
rect(471, 230, 20, 20);
rect(765, 230, 25, 20);
rect(859, 230, 20, 20);

//linea 2 beige
fill(214, 214, 214);
rect(70, 330, 20, 20);
rect(173, 330, 26, 20);
rect(258, 330, 24, 20);
rect(388, 330, 45, 20);
rect(800, 330, 25, 20);
rect(1040.5, 330, 20, 20);
rect(1125.5, 330, 20, 20);

//línea 2 azul
fill(69, 92, 206);
rect(570, 330, 20, 20);
rect(885, 330, 25, 20);

//línea 2 rojo
fill(206, 58, 58);
rect(50, 330, 20, 20);
rect(353, 330, 25, 20);
rect(471, 330, 20, 20);
rect(740.5, 330, 20, 20);

//linea 3 beige
fill(214, 214, 214);
rect(70, 470, 20, 20);
rect(340, 470, 25, 20);
rect(530, 470, 55, 20);
rect(1083, 470, 25, 20);

//línea 3 azul
fill(69, 92, 206);
rect(808, 470, 25, 20);
rect(890, 470, 20, 20);
rect(1060.5, 470, 20, 20);

//línea 3 rojo
fill(206, 58, 58);
rect(403, 470, 25, 20);
rect(490, 470, 25, 20);
rect(567, 470, 20, 20);

//linea 4 beige
fill(214, 214, 214);
rect(70, 530, 20, 20);
rect(220, 530, 20, 20);
rect(350, 530, 20, 20);
rect(1083, 530, 25, 20);

//línea 4 azul
fill(69, 92, 206);
rect(417, 530, 25, 20);
rect(577, 530, 25, 20);
rect(820, 530, 25, 20);
rect(885, 530, 20, 20);

//línea 4 rojo
fill(206, 58, 58);
rect(495, 530, 25, 20);
rect(1125.5, 530, 20, 20);

//línea 5 azul
fill(69, 92, 206);
rect(60, 600, 20, 20);

//linea 6 beige
fill(214, 214, 214);
rect(225, 650, 20, 20);
rect(365, 650, 25, 20);

//línea 6 azul
fill(69, 92, 206);
rect(445, 650, 25, 20);
rect(590, 650, 25, 20);

//línea 4 rojo
fill(206, 58, 58);
rect(517, 650, 25, 20);
rect(670.5, 650, 20, 20);

//línea 7 azul
fill(69, 92, 206);
rect(65, 710, 20, 20);

fill(206, 58, 58);
rect(1040.5, 395, 25, 50);
